app/views/users/likes.html.erb

      <!-- 変数postを定義してください -->
      <% post = Post.find_by(id: like.post_id) %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."post_id" = ? LIMIT ?  [["post_id", 38], ["LIMIT", 1]]