app/controllers/users_controller.rb

  def create
    @user = User.new(name: params[:name], email: params[:email])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mhori"], ["email", "momoka"], ["created_at", "2020-10-23 03:47:21.604140"], ["updated_at", "2020-10-23 03:47:21.604140"]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if @user.save
---
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "momokahori124@gmail.com"], ["updated_at", "2020-10-23 11:14:20.798687"], ["id", 2]]