app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all.order(created_at: :desc)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
---
  def show
    # user/:id ってきた時にidがparamsに入る、、、
    @user = User.find_by(id: params[:id])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)  [["name", "mhori"], ["email", "mhori@gmail.com"], ["created_at", "2020-10-26 06:11:33.845217"], ["updated_at", "2020-10-26 06:11:33.845217"], ["image_name", "me.png"], ["password", "mhori"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "me.png",
      password: params[:password]
    )

    # ここでイメージが送られてこなければデフォルト画像が設定される
    if image = params[:image]
      @user.image_name = "#{@user.id}.jpg"
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "23.jpg"], ["updated_at", "2020-10-26 14:54:12.247929"], ["id", 23]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if image = params[:image]
      @user.image_name = "#{@user.id}.jpg"
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 19]]
---
  def destroy
    @user = User.find_by(id: params[:id])
    @user.destroy